app/controllers/blogs_controller.rb

INSERT INTO "blogs" ("title", "description", "author_name", "is_active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    blog = Blog.new(blog_params)
    if blog.save

UPDATE "blogs" SET "title" = ?, "author_name" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["title", "Metafic New Blog"], ["author_name", "Metafic Author"], ["updated_at", "2023-02-22 10:01:47.020076"], ["id", 1]]
---
  def update
    if @blog.present?
      if @blog.update(blog_params)

DELETE FROM "blogs" WHERE "blogs"."id" = ?  [["id", 1]]
---
  def destroy
    if @blog.present?
      if @blog.destroy

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def get_blog
    @blog = Blog.find_by(id: params[:id])